<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;">

# <center> Проект: Анализ вакансий из HeadHunter

In [1]:
import pandas as pd
import psycopg2

In [2]:
DBNAME = 'project_sql'
USER = 'skillfactory'
PASSWORD = 'cCkxxLVrDE8EbvjueeMedPKt'
HOST = '84.201.134.129'
PORT = 5432

In [3]:
connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
)

# Юнит 3. Предварительный анализ данных

1. Напишите запрос, который посчитает количество вакансий в нашей базе (вакансии находятся в таблице vacancies).

In [4]:
# текст запроса
query_3_1 = f'''select count(*)
           from vacancies
'''

In [5]:
# результат запроса
df = pd.read_sql_query(query_3_1, connection)
df

C:\Users\vladk\AppData\Local\Temp\ipykernel_6684\1114379196.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_1, connection)

   count
0  49197

2. Напишите запрос, который посчитает количество работодателей (таблица employers).

In [6]:
# текст запроса
query_3_2 = f'''select count(*)
           from employers
'''

In [7]:
# результат запроса
df = pd.read_sql_query(query_3_2, connection)
df

C:\Users\vladk\AppData\Local\Temp\ipykernel_6684\3062646138.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_2, connection)

   count
0  23501

3. Посчитате с помощью запроса количество регионов (таблица areas).

In [8]:
# текст запроса
query_3_3 = f'''select count(*)
           from areas
'''

In [9]:
# результат запроса
df = pd.read_sql_query(query_3_3, connection)
df

C:\Users\vladk\AppData\Local\Temp\ipykernel_6684\928149064.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_3, connection)

   count
0   1362

4. Посчитате с помощью запроса количество сфер деятельности в базе (таблица industries).

In [10]:
# текст запроса
query_3_4 = f'''select count(*)
           from industries
           '''

In [11]:
# результат запроса
df = pd.read_sql_query(query_3_4, connection)
df

C:\Users\vladk\AppData\Local\Temp\ipykernel_6684\2101691108.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_4, connection)

   count
0    294

***

# выводы по предварительному анализу данных
Мы получили общие данные о колличестве вакансий, работодателей, регионов и сфер деятельности данные нам в базах данных.

# Юнит 4. Детальный анализ вакансий

1. Напишите запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area).
Отсортируйте по количеству вакансий в порядке убывания.

In [12]:
# текст запроса
query_4_1 = f'''select 
            count(v.*) cnt,
            a.name area
           from vacancies v
           join areas a on v.area_id=a.id
           GROUP BY 2 
           ORDER BY 1 DESC
           limit 5
           '''

In [13]:
# результат запроса
df = pd.read_sql_query(query_4_1, connection)
df

C:\Users\vladk\AppData\Local\Temp\ipykernel_6684\2457173557.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_1, connection)

    cnt             area
0  5333           Москва
1  2851  Санкт-Петербург
2  2112            Минск
3  2006      Новосибирск
4  1892           Алматы

2. Напишите запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [14]:
# текст запроса
query_4_2 = f'''select 
            count(*)
           from vacancies 
           where salary_from is not null or salary_to is not null
           '''

In [15]:
# результат запроса
df = pd.read_sql_query(query_4_2, connection)
df

C:\Users\vladk\AppData\Local\Temp\ipykernel_6684\970655580.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_2, connection)

   count
0  24073

3. Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до целого.

In [16]:
# текст запроса
query_4_3 = f'''select 
            round(avg(salary_from),0) min_avg,
            round(avg(salary_to),0) max_avg
           from vacancies 
'''

In [17]:
# результат запроса
df = pd.read_sql_query(query_4_3, connection)
df

C:\Users\vladk\AppData\Local\Temp\ipykernel_6684\2500607024.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_3, connection)

   min_avg   max_avg
0  71065.0  110537.0

4. Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Результат отсортируйте по убыванию количества.

In [18]:
# текст запроса
query_4_4 = f'''select
            schedule,
            employment,
            count(*)
           from vacancies 
           GROUP BY 1, 2 
           order by 3 desc
           limit 2
'''

In [19]:
# результат запроса
df = pd.read_sql_query(query_4_4, connection)
df

C:\Users\vladk\AppData\Local\Temp\ipykernel_6684\2022935265.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_4, connection)

           schedule        employment  count
0       Полный день  Полная занятость  35367
1  Удаленная работа  Полная занятость   7802

5. Напишите запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [20]:
# текст запроса
query_4_5 = f'''select
            experience,
            count(id)
           from vacancies 
           group by 1
           order by 2
'''

In [21]:
# результат запроса
df = pd.read_sql_query(query_4_5, connection)
df

C:\Users\vladk\AppData\Local\Temp\ipykernel_6684\2316260449.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_5, connection)

           experience  count
0         Более 6 лет   1337
1           Нет опыта   7197
2       От 3 до 6 лет  14511
3  От 1 года до 3 лет  26152

***

Детальный анализ данных показал ожидаемую концентрацию спроса на трудовые ресурсы в наиболее крупных городах миллионниках, средний размер зарплатных ожиданий от 70 до 100 тыс., предпочтения полной занятости независимо от типа рабочего графика и небольшого количества вакансий не содержащих требований к опыту работы, как и имеющих повышенные требования к опыту работы более 6 лет.

# Юнит 5. Анализ работодателей

1. Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [23]:
# текст запроса
query_5_1 = f'''select 
            count(v.*),
            e.name
           from vacancies v
           join employers e on v.employer_id=e.id
           GROUP BY 2 
           ORDER BY 1 DESC
           limit 5
           '''

In [24]:
# результат запроса
df = pd.read_sql_query(query_5_1, connection)
df

C:\Users\vladk\AppData\Local\Temp\ipykernel_6684\3834399874.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_1, connection)

   count           name
0   1933         Яндекс
1    491     Ростелеком
2    444       Тинькофф
3    428           СБЕР
4    331  Газпром нефть

2. Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [25]:
# текст запроса
query_5_2 = f'''
SELECT 
    a.name as "Название города",
    COUNT(distinct e.id) as "кол-во работодателей",
    COUNT(distinct v.id) as "кол-во вакансий"
FROM areas a 
LEFT JOIN employers e ON a.id = e.area 
LEFT JOIN vacancies v ON v.area_id = a.id
WHERE v.id is null
GROUP BY 1
ORDER BY 2 DESC
LIMIT 10
           '''

In [26]:
# результат запроса
df = pd.read_sql_query(query_5_2, connection)
df

C:\Users\vladk\AppData\Local\Temp\ipykernel_6684\2250345976.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_2, connection)

         Название города  кол-во работодателей  кол-во вакансий
0                 Россия                   410                0
1              Казахстан                   207                0
2     Московская область                    75                0
3     Краснодарский край                    19                0
4               Беларусь                    18                0
5     Ростовская область                    18                0
6            Азербайджан                    17                0
7  Нижегородская область                    16                0
8   Республика Татарстан                    16                0
9             Узбекистан                    15                0

3. Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Отсортируйте результат по убыванию количества.

In [27]:
# текст запроса
query_5_3 = f'''
SELECT 
    e.name,
    COUNT(distinct v.area_id)
FROM employers e
join vacancies v on v.employer_id=e.id
GROUP BY 1
ORDER BY 2 DESC
           '''

In [28]:
# результат запроса
df = pd.read_sql_query(query_5_3, connection)
df

C:\Users\vladk\AppData\Local\Temp\ipykernel_6684\201667002.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_3, connection)

                         name  count
0                      Яндекс    181
1                  Ростелеком    152
2                  Спецремонт    116
3      Поляков Денис Иванович     88
4                   ООО ЕФИН      71
...                       ...    ...
14761                  UniSol      1
14762            UNISTORY LLC      1
14763                   UNIT6      1
14764     United Distribution      1
14765              UNITEL LLC      1

[14766 rows x 2 columns]

4. Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [29]:
# текст запроса
query_5_4 = f'''
SELECT 
    COUNT(*)
FROM employers e
    left join employers_industries i on i.employer_id=e.id
where i.industry_id is null
           '''

In [30]:
# результат запроса
df = pd.read_sql_query(query_5_4, connection)
df

C:\Users\vladk\AppData\Local\Temp\ipykernel_6684\3493105328.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_4, connection)

   count
0   8419

5. Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [31]:
# текст запроса
query_5_5 = f'''
SELECT 
    e.name
FROM employers e
    left join employers_industries i on i.employer_id=e.id
group by 1
HAVING count(i.industry_id) = 4
order by 1
limit 3
           '''

In [32]:
# результат запроса
df = pd.read_sql_query(query_5_5, connection)
df

C:\Users\vladk\AppData\Local\Temp\ipykernel_6684\388711819.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_5, connection)

           name
0  101 Интернет
1      21vek.by
2          2ГИС

6. С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана Разработка программного обеспечения.

In [33]:
# текст запроса
query_5_6 = f'''
SELECT 
    count(*)
FROM employers_industries ei
    left join employers e  on ei.employer_id=e.id
    left join industries i on ei.industry_id=i.id
    where i.name = 'Разработка программного обеспечения'
           '''

In [34]:
# результат запроса
df = pd.read_sql_query(query_5_6, connection)
df

C:\Users\vladk\AppData\Local\Temp\ipykernel_6684\821628714.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_6, connection)

   count
0   3553

7. Для компании «Яндекс» выведите список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку Total с общим количеством вакансий компании. Результат отсортируйте по возрастанию количества.

Список городов-милионников надо взять [отсюда](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8). 

Если возникнут трудности с этим задание посмотрите материалы модуля  PYTHON-17. Как получать данные из веб-источников и API.

In [35]:
# код для получения списка городов-милионников
import urllib.parse as req

path_common = req.urlparse('https://ru.wikipedia.org/wiki/Города-миллионеры_России#Список_городов-миллионеров')
url = path_common.scheme + '://' + req.quote(path_common.netloc) +  req.quote(path_common.path) + '#'+ req.quote(path_common.fragment)
cities = tuple(pd.read_html(url)[1]['Город'])

In [36]:
# текст запроса
query_5_7 = f'''
SELECT 
    a.name AS region,
    COUNT(v.*) AS vacancy_count
FROM vacancies v
    LEFT JOIN areas a ON a.id = v.area_id
    LEFT JOIN employers e ON v.employer_id = e.id
WHERE a.name IN {cities}
    AND e.name = 'Яндекс'
GROUP BY a.name

UNION ALL

SELECT 
    'Total' AS region, 
    (SELECT COUNT(v.*) 
     FROM vacancies v
         LEFT JOIN areas a ON a.id = v.area_id
         LEFT JOIN employers e ON v.employer_id = e.id
     WHERE a.name IN {cities}
         AND e.name = 'Яндекс') AS vacancy_total;
           '''

In [37]:
# результат запроса
df = pd.read_sql_query(query_5_7, connection)
df

C:\Users\vladk\AppData\Local\Temp\ipykernel_6684\1965596796.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_7, connection)

             region  vacancy_count
0         Волгоград             24
1           Воронеж             32
2      Екатеринбург             39
3            Казань             25
4         Краснодар             30
5        Красноярск             23
6            Москва             54
7   Нижний Новгород             36
8       Новосибирск             35
9              Омск             21
10            Пермь             25
11   Ростов-на-Дону             25
12           Самара             26
13  Санкт-Петербург             42
14              Уфа             26
15        Челябинск             22
16            Total            485

***

Анализ данных по работодателям покозал, что наибольшее колличество вакансий в наибольшем количестве регионов где эти вакансии размещены. При этом наибольшая концентрация вакансий отмечается в городах-миллионниках.

# Юнит 6. Предметный анализ

1. Сколько вакансий имеет отношение к данным?

Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова 'data' или 'данн'.

*Подсказка: Обратите внимание, что названия вакансий могут быть написаны в любом регистре.*

In [39]:
# текст запроса
query_6_1 = f'''select 
            count(*)
           from vacancies
           where name ilike '%data%'or name ilike '%данн%'
           '''

In [40]:
# результат запроса
df = pd.read_sql_query(query_6_1, connection)
df

C:\Users\vladk\AppData\Local\Temp\ipykernel_6684\366702258.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_1, connection)

   count
0   1771

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста? 
Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
* 'data scientist'
* 'data science'
* 'исследователь данных'
* 'ML' (здесь не нужно брать вакансии по HTML)
* 'machine learning'
* 'машинн%обучен%'

** В следующих заданиях мы продолжим работать с вакансиями по этому условию.*

Считаем вакансиями для специалистов уровня Junior следующие:
* в названии есть слово 'junior' *или*
* требуемый опыт — Нет опыта *или*
* тип трудоустройства — Стажировка.

In [41]:
# текст запроса
query_6_2 = f'''select 
            count(*)
           from vacancies
           where (lower(name) like '%data scientist%'  or
        lower(name) like '%data science%' or
        lower(name) like '%исследователь данных%'  or
        (name like '%ML%' and name not ilike '%HTML%')  or
        lower(name) like '%machine learning%'  or
        lower(name) like '%машинн%обучен%')
        and (name ilike '%junior%'
        or experience like 'Нет опыта'
        or employment like 'Стажировка')
           '''

In [42]:
# результат запроса
df = pd.read_sql_query(query_6_2, connection)
df

C:\Users\vladk\AppData\Local\Temp\ipykernel_6684\2267038862.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_2, connection)

   count
0     51

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres?

** Критерии для отнесения вакансии к DS указаны в предыдущем задании.*

In [43]:
# текст запроса
query_6_3 = f'''select 
            count(*)
           from vacancies
           where (lower(name) like '%data scientist%'  or
        lower(name) like '%data science%' or
        lower(name) like '%исследователь данных%'  or
        (name like '%ML%' and name not ilike '%HTML%')  or
        lower(name) like '%machine learning%'  or
        lower(name) like '%машинн%обучен%')
        and
        (key_skills ilike '%SQL%' or key_skills ilike '%postgres%')
           '''

In [44]:
# результат запроса
df = pd.read_sql_query(query_6_3, connection)
df

C:\Users\vladk\AppData\Local\Temp\ipykernel_6684\3794299702.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_3, connection)

   count
0    201

4. Проверьте, насколько популярен Python в требованиях работодателей к DS.Для этого вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

** Это можно сделать помощью запроса, аналогичного предыдущему.*

In [45]:
# текст запроса
query_6_4 = f'''select 
            count(*)
           from vacancies
           where (lower(name) like '%data scientist%'  or
        lower(name) like '%data science%' or
        lower(name) like '%исследователь данных%'  or
        (name like '%ML%' and name not ilike '%HTML%')  or
        lower(name) like '%machine learning%'  or
        lower(name) like '%машинн%обучен%')
        and
        (key_skills ilike '%python%')
           '''

In [46]:
# результат запроса
df = pd.read_sql_query(query_6_4, connection)
df

C:\Users\vladk\AppData\Local\Temp\ipykernel_6684\4264665179.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_4, connection)

   count
0    351

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?
Ответ округлите до двух знаков после точки-разделителя.

In [47]:
# текст запроса
query_6_5 = f'''select 
            round(avg(length(key_skills)-length(replace(key_skills, CHR(9), ''))+1), 2) as result
           from vacancies
           where (lower(name) like '%data scientist%'  or
        lower(name) like '%data science%' or
        lower(name) like '%исследователь данных%'  or
        (name like '%ML%' and name not ilike '%HTML%')  or
        lower(name) like '%machine learning%'  or
        lower(name) like '%машинн%обучен%')       
           '''

In [48]:
# результат запроса
df = pd.read_sql_query(query_6_5, connection)
df

C:\Users\vladk\AppData\Local\Temp\ipykernel_6684\3654210517.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_5, connection)

   result
0    6.41

6. Напишите запрос, позволяющий вычислить, какую зарплату для DS в **среднем** указывают для каждого типа требуемого опыта (уникальное значение из поля *experience*). 

При решении задачи примите во внимание следующее:
1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
2. Если заполнены оба поля с зарплатой, то считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, то его и считаем зарплатой по вакансии.
3. Если в расчётах участвует null, в результате он тоже даст null (посмотрите, что возвращает запрос select 1 + null). Чтобы избежать этой ситуацию, мы воспользуемся функцией [coalesce](https://postgrespro.ru/docs/postgresql/9.5/functions-conditional#functions-coalesce-nvl-ifnull), которая заменит null на значение, которое мы передадим. Например, посмотрите, что возвращает запрос `select 1 + coalesce(null, 0)`

Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до целого числа.

In [94]:
# текст запроса
query_6_6 = f'''select 
            experience,
            ROUND(AVG(COALESCE((salary_from + salary_to) / 2, salary_from, salary_to)))
           from vacancies
           where (lower(name) like '%data scientist%'  or
        lower(name) like '%data science%' or
        lower(name) like '%исследователь данных%'  or
        (name like '%ML%' and name not ilike '%HTML%')  or
        lower(name) like '%machine learning%'  or
        lower(name) like '%машинн%обучен%') 
        and (salary_from is not null or salary_to is not null)
        group by 1      
           '''

In [95]:
# результат запроса
df = pd.read_sql_query(query_6_6, connection)
df

C:\Users\vladk\AppData\Local\Temp\ipykernel_6684\519194770.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_6, connection)

           experience     round
0           Нет опыта   74643.0
1  От 1 года до 3 лет  139675.0
2       От 3 до 6 лет  243115.0

***

Из работы мы получили полезные данные, связанные с востребованностью профессии, важности навыков и также затронули заработные платы основанные на опыте работы, что в совокупности является важным при трудоустройстве.

# Общий вывод по проекту

Проведенный анализ данных показал возможность с использованием данной базы данных определять количественные и качественные характеристики по различным типам данных, относящихся к вакансиям, работодателям, регионам и отраслям, определять различные взаимосвязи между разными разделами данных благодаря наличию связывающих данные в разных таблицах id. На примере данных по вакансиям и работодателям показана возможность определения свойственных им закономерностям и тенденциям, а так же на примере вакансий относящихся к нашей специальности, продемострирована возможность выявления данных по узким и спецефическим выборкам.